In [71]:
!ls

test.csv  Titanic.ipynb  train.csv

In [72]:
import pandas as pd

In [73]:
train_df = pd.read_csv('train.csv')
test_df = pd.read_csv('test.csv')

In [74]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [75]:
y_train = train_df['Survived']
x_train = train_df.drop(['Survived', 'PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked'], axis=1)

In [76]:
y_train.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [77]:
x_train.head()

   Pclass     Sex   Age  SibSp  Parch     Fare
0       3    male  22.0      1      0   7.2500
1       1  female  38.0      1      0  71.2833
2       3  female  26.0      0      0   7.9250
3       1  female  35.0      1      0  53.1000
4       3    male  35.0      0      0   8.0500

In [78]:
x_train[['Sex']] = x_train[['Sex']] == 'male'

In [79]:
x_train.head()

   Pclass    Sex   Age  SibSp  Parch     Fare
0       3   True  22.0      1      0   7.2500
1       1  False  38.0      1      0  71.2833
2       3  False  26.0      0      0   7.9250
3       1  False  35.0      1      0  53.1000
4       3   True  35.0      0      0   8.0500

In [97]:
from sklearn.ensemble import GradientBoostingClassifier
from sklearn.ensemble import RandomForestClassifier
gb_clf = GradientBoostingClassifier()
rf_clf = RandomForestClassifier()

In [81]:
len(x_train)

891

In [82]:
rows = x_train.isnull().any(axis=1)

In [83]:
x_train = x_train[~rows]

In [85]:
y_train = y_train[~rows]

In [86]:
len(x_train)

714

In [87]:
len(y_train)

714

In [98]:
gb_clf = gb_clf.fit(x_train.values, y_train)
rf_clf = rf_clf.fit(x_train.values, y_train)

/home/michal/Desktop/dalex/ceteris_env/lib/python3.5/site-packages/sklearn/ensemble/forest.py:248: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

In [99]:
import numpy as np

In [127]:
boy = np.array([[3, 1, 2, 3, 1, 10]])

#### Survival chance

In [128]:
gb_clf.predict_proba(boy)[0][1]

0.02825569347776241

In [106]:
gb_clf.classes_

array([0, 1])